gillwei7/NXP_RT600/boards/mimxrt685audevk/dsp_examples/xaf_usb_demo/dsp/srtm_LineInOut.c
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <errno.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <xtensa/xos.h>
#include "fsl_i2s.h"
#include "xaf-utils-test.h"
#include "xa_error_standards.h"
#include "audio/xa-renderer-api.h"
#include "audio/xa-pcm-gain-api.h"
#include "audio/xa-capturer-api.h"

#if XA_CLIENT_PROXY
#include "client_proxy_api.h"
#endif

#include "dsp_config.h"
#include "srtm_utils.h"
#include "srtm_config_audio.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
//#define AUDIO_FRMWK_BUF_SIZE (64 * 1024)
//#define AUDIO_COMP_BUF_SIZE  (256 * 1024)

#define AUDIO_FRMWK_BUF_SIZE (32 * 1024)
#define AUDIO_COMP_BUF_SIZE  (140 * 1024)

#define PCM_GAIN_FRAME_SIZE (1024)	// TYM DSP chg from 1920 record setiing to 1024 TDM 
#define RENDERER_FRAME_SIZE (1024)

enum
{
    XA_COMP = -1,
    XA_CAPTURER_0,
    XA_GAIN_0,
    XA_RENDERER_0,
    NUM_COMP_IN_GRAPH,
};

const int comp_get_order_lineinout[] = {XA_CAPTURER_0,
							XA_GAIN_0,
							XA_RENDERER_0};

#define MAX_CHANNELS  8
#define MAX_WIDTH     32
#define FRAME_SIZE_MS	10
/*******************************************************************************
 * Component Setup/ Config
 ******************************************************************************/
unsigned char LineInOut_process_stack[STACK_SIZE];
unsigned char LineInOut_cleanup_stack[STACK_SIZE];
int srtm_lineInOut_cleanup(void *arg, int wake_value);

static void *comp_get_pointer(dsp_handle_t *dsp, int cid, bool addr)
{
    switch (cid)
    {
        case XA_GAIN_0:
            return (addr ? &dsp->comp_gain : dsp->comp_gain);
        case XA_RENDERER_0:
            return (addr ? &dsp->comp_renderer : dsp->comp_renderer);
        case XA_CAPTURER_0:
            return (addr ? &dsp->comp_capturer : dsp->comp_capturer);
        default:
            DSP_PRINTF("[DSP_LINE_INOUT] Check component type in comp_get_order table\n\r");
            return NULL;
    }
}

static void comp_clean(dsp_handle_t *dsp)
{
    dsp->audio_device      = NULL;
    dsp->comp_gain         = NULL;
    dsp->comp_renderer     = NULL;
    dsp->comp_capturer 	   = NULL;
    dsp->comp              = NULL;
}

static int LineInOut_close(dsp_handle_t *dsp, bool success)
{
    int i, cid;
    XAF_ERR_CODE ret;

    for (i = 0; i < NUM_COMP_IN_GRAPH; i++)
    {
        cid = comp_get_order_lineinout[i];
        if (comp_get_pointer(dsp, cid, false) == NULL)
            continue;
        ret = xaf_comp_delete(comp_get_pointer(dsp, cid, false));
        if (ret != XAF_NO_ERR)
            DSP_PRINTF("[DSP_LINE_INOUT] xaf_comp_delete[%d] failure: %d\r\n", i, ret);
    }

    ret = xaf_adev_close(dsp->audio_device, XAF_ADEV_NORMAL_CLOSE);
    if (ret != XAF_NO_ERR)
        DSP_PRINTF("[DSP_LINE_INOUT] xaf_adev_close failure: %d\r\n", ret);
    else
        DSP_PRINTF("[DSP_LINE_INOUT] Audio device closed\r\n\r\n");

    // TYM DSP mark : temp no feedback to application (cm33)
//    /* Send message to the application */
//    if (success)
//        DSP_SendUsbEnd(dsp, USB_SpeakerDevice);
//    else
//        DSP_SendUsbError(dsp, USB_SpeakerDevice);

    return (success ? 0 : -1);
}

static int capturer_setup(void *p_capturer, xaf_format_t *format, bool i2s)
{
    int param[22];
    int num_params = 3;

    param[0] = XA_CAPTURER_CONFIG_PARAM_PCM_WIDTH;
    param[1] = format->pcm_width;
    param[2] = XA_CAPTURER_CONFIG_PARAM_CHANNELS;
    param[3] = format->channels;
    param[4] = XA_CAPTURER_CONFIG_PARAM_SAMPLE_RATE;
    param[5] = format->sample_rate;


    if (i2s)
    {
        num_params = 11;

        param[6] = XA_CAPTURER_CONFIG_PARAM_FRAME_SIZE;		// TYM DSP add
		param[7] = RENDERER_FRAME_SIZE;						// TYM DSP add
//        param[7] = (format->pcm_width >> 3) * format->channels * (format->sample_rate * FRAME_SIZE_MS / 1000);						// TYM DSP add
//        param[7] = 192;						// TYM DSP add
        param[8]  = XA_CAPTURER_CONFIG_PARAM_I2S_MASTER_SLAVE;
        param[9]  = 0;
        param[10] = XA_CAPTURER_CONFIG_PARAM_I2S_MODE;
        param[11] = (int)kI2S_ModeDspWsShort;	// kI2S_ModeI2sClassic
        param[12] = XA_CAPTURER_CONFIG_PARAM_I2S_SCK_POLARITY;
        param[13] = 0;
        param[14] = XA_CAPTURER_CONFIG_PARAM_I2S_WS_POLARITY;
        param[15] = 0;
        param[16] = XA_CAPTURER_CONFIG_PARAM_AUDIO_BUFFER_1;
        param[17] = (int)DSP_AUDIO_BUFFER_2_PING;
        param[18] = XA_CAPTURER_CONFIG_PARAM_AUDIO_BUFFER_2;
        param[19] = (int)DSP_AUDIO_BUFFER_2_PONG;
        param[20] = XA_CAPTURER_CONFIG_PARAM_I2S_INTERFACE;
        param[21] = AUDIO_I2S_CAPTURER_DEVICE;
    }

    return xaf_comp_set_config(p_capturer, num_params, &param[0]);
}

static int pcm_gain_setup(void *p_comp, xaf_format_t *format, bool i2s)
{
    int param[10];

    param[0] = XA_PCM_GAIN_CONFIG_PARAM_CHANNELS;
    param[1] = format->channels;
    param[2] = XA_PCM_GAIN_CONFIG_PARAM_SAMPLE_RATE;
    param[3] = format->sample_rate;
    param[4] = XA_PCM_GAIN_CONFIG_PARAM_PCM_WIDTH;
    param[5] = format->pcm_width;
    param[6] = XA_PCM_GAIN_CONFIG_PARAM_FRAME_SIZE;
//    param[7] = (format->pcm_width >> 3) * format->channels * (format->sample_rate * FRAME_SIZE_MS / 1000);	// TYM DSP mark
    param[7] = PCM_GAIN_FRAME_SIZE;		// TYM DSP add tofu
    param[8] = XA_PCM_GAIN_CONFIG_PARAM_GAIN_FACTOR;
    param[9] = 10;

    return xaf_comp_set_config(p_comp, 5, &param[0]);
}

static XAF_ERR_CODE renderer_setup(void *p_renderer, xaf_format_t *format, bool i2s)
{
    int param[26];
    int num_param;
    int numChannels = format->channels;
    num_param = 7;

    param[0]  = XA_RENDERER_CONFIG_PARAM_PCM_WIDTH;
    param[1]  = format->pcm_width;
    param[2]  = XA_RENDERER_CONFIG_PARAM_CHANNELS;
    param[3]  = format->channels;
    param[4]  = XA_RENDERER_CONFIG_PARAM_SAMPLE_RATE;
    param[5]  = format->sample_rate;
    param[6]  = XA_RENDERER_CONFIG_PARAM_FRAME_SIZE;
//    param[7]  = (format->pcm_width / 8) * numChannels * (format->sample_rate * FRAME_SIZE_MS / 1000);
    param[7]  = RENDERER_FRAME_SIZE;
    param[8]  = XA_RENDERER_CONFIG_PARAM_AUDIO_BUFFER_1;
    param[9]  = (int)DSP_AUDIO_BUFFER_1_PING;
    param[10] = XA_RENDERER_CONFIG_PARAM_AUDIO_BUFFER_2;
    param[11] = (int)DSP_AUDIO_BUFFER_1_PONG;
    param[12] = XA_RENDERER_CONFIG_PARAM_I2S_INTERFACE;
    param[13] = AUDIO_I2S_RENDERER_DEVICE;
    if (numChannels > 2)
    {
        num_param = 10;

