gillwei7/NXP_RT600/boards/mimxrt685audevk/dsp_examples/xaf_usb_demo/dsp/srtm_LineInOut.c
        param[14] = XA_RENDERER_CONFIG_PARAM_I2S_MODE;
        param[15] = kI2S_ModeDspWsShort;
        param[16] = XA_RENDERER_CONFIG_PARAM_I2S_WS_POLARITY;
        param[17] = true;
        param[18] = XA_RENDERER_CONFIG_PARAM_I2S_POSITION;
        param[19] = 1U;

        param[20] = XA_RENDERER_CONFIG_PARAM_CODEC_PCM_WIDTH;
        param[21] = MAX_WIDTH;
        param[22] = XA_RENDERER_CONFIG_PARAM_CODEC_CHANNELS;
        param[23] = MAX_CHANNELS;
        param[24] = XA_RENDERER_CONFIG_PARAM_CODEC_FRAME_SIZE;
//        param[25] = (MAX_WIDTH / 8) * MAX_CHANNELS * (format->sample_rate * FRAME_SIZE_MS / 1000);
        param[25] = RENDERER_FRAME_SIZE;
    }

    return xaf_comp_set_config(p_renderer, num_param, &param[0]);
}

/* Explicitly start the capturer component.
 * This will initiate the I2S DMA input. */
static int capturer_start_operation(void *p_comp)
{
    int param[2];

    param[0] = XA_CAPTURER_CONFIG_PARAM_STATE;
    param[1] = XA_CAPTURER_STATE_START;

    return xaf_comp_set_config(p_comp, 1, &param[0]);
}

/* Explicitly start the renderer component.
 * This will begin the I2S DMA output with zeros until valid data comes in. */
static int renderer_start_operation(void *p_comp)
{
    int param[2];

    param[0] = XA_RENDERER_CONFIG_PARAM_STATE;
    param[1] = XA_RENDERER_STATE_START;

    return xaf_comp_set_config(p_comp, 1, &param[0]);
}

/*******************************************************************************
 * Commands processing
 ******************************************************************************/
#if 1
int srtm_line_inout_init(dsp_handle_t *dsp, unsigned int *pCmdParams, bool i2s)
{
    int channels, sampling_rate, width, cid, cid_prev, i;
    xaf_format_t comp_format[NUM_COMP_IN_GRAPH];
    int (*comp_setup[NUM_COMP_IN_GRAPH])(void *p_comp, xaf_format_t *, bool);
    void *usbSpeaker_inbuf[1];
    xaf_comp_type comp_type[NUM_COMP_IN_GRAPH];
    xf_id_t comp_id[NUM_COMP_IN_GRAPH];
    int comp_ninbuf[NUM_COMP_IN_GRAPH];
    int comp_noutbuf[NUM_COMP_IN_GRAPH];
    XAF_ERR_CODE ret;
    xaf_comp_status comp_status;
    xaf_adev_config_t device_config;
    xaf_comp_config_t comp_config[NUM_COMP_IN_GRAPH];
    int comp_info[4];
    uint32_t read_length;
    int renderer_state, param[4];	// TYM DSP add

    /* Parameters reading */
    channels      = pCmdParams[0];
    sampling_rate = pCmdParams[1];
    width         = pCmdParams[2];

    comp_clean(dsp);

    /* Component data preparation */
    for (i = 0; i < NUM_COMP_IN_GRAPH; i++)
    {
        cid = comp_get_order_lineinout[i];
        memset(&comp_format[cid], 0, sizeof(xaf_format_t));
        comp_setup[cid]   = NULL;
        comp_type[cid]    = -1;
        comp_id[cid]      = NULL;
        comp_ninbuf[cid]  = 0;
        comp_noutbuf[cid] = 0;

        switch (cid)
        {
            case XA_CAPTURER_0:
                comp_format[cid].sample_rate = sampling_rate;
                comp_format[cid].channels    = channels;
                comp_format[cid].pcm_width   = width;
                comp_setup[cid]              = capturer_setup;
                comp_type[cid]               = XAF_CAPTURER;
                if (i2s)
                {
                	DSP_PRINTF("[TYM][LINE] i2s\r\n");
                    comp_id[cid] = "capturer_i2s";
                }
                else
                {
                	DSP_PRINTF("[TYM][LINE] dmic\r\n");
                    comp_id[cid] = "capturer_dmic";
                }
                break;
            case XA_GAIN_0:
                comp_format[cid].sample_rate = sampling_rate;
                comp_format[cid].channels    = channels;
                comp_format[cid].pcm_width   = width;
                comp_setup[cid]              = pcm_gain_setup;
                comp_type[cid]               = XAF_POST_PROC;
                comp_id[cid]                 = "post-proc/pcm_gain";
//                comp_ninbuf[cid]             = 1;
                break;
            case XA_RENDERER_0:
                comp_format[cid].sample_rate = sampling_rate;
                comp_format[cid].channels    = channels;
                comp_format[cid].pcm_width   = width;
                comp_setup[cid]              = renderer_setup;
                comp_type[cid]               = XAF_RENDERER;
                comp_id[cid]                 = "renderer";
                break;

            default:
                DSP_PRINTF("[DSP_LINE_INOUT] Check component type in comp_get_order table\n\r");
                return -1;
        }
    }

    /* Initialize XAF */
    xaf_adev_config_default_init(&device_config);

    device_config.pmem_malloc                 = DSP_Malloc;
    device_config.pmem_free                   = DSP_Free;
    device_config.audio_component_buffer_size = AUDIO_COMP_BUF_SIZE;
    device_config.audio_framework_buffer_size = AUDIO_FRMWK_BUF_SIZE;

    ret = xaf_adev_open(&dsp->audio_device, &device_config);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("[DSP_LINE_INOUT] xaf_adev_open failure: %d\r\n", ret);
        return -1;
    }

    DSP_PRINTF("[DSP_LINE_INOUT] Audio Device Ready\n\r");

    /* Create and setup all components */
    for (i = 0; i < NUM_COMP_IN_GRAPH; i++)
    {
        cid = comp_get_order_lineinout[i];
        DSP_PRINTF("[TYM][DSP_LINE_INOUT] i: %d, cid: %d\r\n",i,cid);
        xaf_comp_config_default_init(&comp_config[cid]);

        comp_config[cid].comp_id            = comp_id[cid];
        comp_config[cid].num_input_buffers  = comp_ninbuf[cid];
        comp_config[cid].num_output_buffers = comp_noutbuf[cid];
        comp_config[cid].comp_type          = comp_type[cid];
        comp_config[cid].pp_inbuf = comp_ninbuf[cid] > 0 ? (pVOID(*)[XAF_MAX_INBUFS]) & usbSpeaker_inbuf[0] : NULL;
        DSP_PRINTF("[TYM][DSP_LINE_INOUT] id[%d]:%s, in_num: %d, out_num: %d,  type: %d\r\n", i, comp_config[cid].comp_id, comp_config[cid].num_input_buffers, comp_config[cid].num_output_buffers, comp_config[cid].comp_type);
        /* Create component */
        ret = xaf_comp_create(dsp->audio_device, comp_get_pointer(dsp, cid, true), &comp_config[cid]);
        if (ret != XAF_NO_ERR)
        {
            DSP_PRINTF("[DSP_LINE_INOUT] xaf_comp_create[%d] failure: %d\r\n", i, ret);
            goto error_cleanup;
        }

        /* Setup component */
        ret = comp_setup[cid](comp_get_pointer(dsp, cid, false), &comp_format[cid], i2s);
        DSP_PRINTF("[TYM][DSP_LINE_INOUT] ret:%d, id[%d]:%s, sRate: %d, ch: %d,  width: %d\r\n",ret, i, comp_config[cid].comp_id, comp_format[cid].sample_rate, comp_format[cid].channels, comp_format[cid].pcm_width);

        /* Start component */
        ret = xaf_comp_process(dsp->audio_device, comp_get_pointer(dsp, cid, false), NULL, 0, XAF_START_FLAG);
        if (ret != XAF_NO_ERR)
        {
            DSP_PRINTF("[DSP_LINE_INOUT] xaf_comp_process XAF_START_FLAG %s failure: %d\r\n", comp_id[cid], ret);
            goto error_cleanup;
        }

        /* Check status of the component */
        ret = xaf_comp_get_status(dsp->audio_device, comp_get_pointer(dsp, cid, false), &comp_status, &comp_info[0]);
        if (ret != XAF_NO_ERR)
        {
            DSP_PRINTF("[DSP_LINE_INOUT] xaf_comp_get_status %s failure: %d\r\n", comp_id[cid], ret);
            goto error_cleanup;
        }

        if (i == 1)
        {
            if (comp_status != XAF_INIT_DONE)
            {
                DSP_PRINTF("[DSP_LINE_INOUT] xaf_comp_get_status failed to init\n\r");
                goto error_cleanup;
            }
            dsp->comp = comp_get_pointer(dsp, cid, false);
        }

        DSP_PRINTF("[DSP_LINE_INOUT] %s component started\r\n", comp_id[cid]);

        /* Start renderer DMA output.  Will output I2S zeros until valid data is available. */
        if (cid == XA_RENDERER_0){
            renderer_start_operation(comp_get_pointer(dsp, cid, false));
        }
        if (cid == XA_CAPTURER_0){
            capturer_start_operation(comp_get_pointer(dsp, cid, false));
        }

        /* Connect all components */
        if (i > 0)
        {
            cid_prev = comp_get_order_lineinout[i - 1];
            if (i==1)
            	ret      = xaf_connect(comp_get_pointer(dsp, cid_prev, false), 0, comp_get_pointer(dsp, cid, false), 0, 4);
            else
            	ret      = xaf_connect(comp_get_pointer(dsp, cid_prev, false), 1, comp_get_pointer(dsp, cid, false), 0, 4);
            if (ret != XAF_NO_ERR)
            {
                DSP_PRINTF("[DSP_LINE_INOUT] xaf_connect failure: %d\r\n", ret);
                goto error_cleanup;
            }

            DSP_PRINTF("[DSP_LINE_INOUT] Connected %s -> %s\n\r", comp_id[cid_prev], comp_id[cid]);
        }
    }

