gillwei7/NXP_RT600/boards/mimxrt685audevk/dsp_examples/xaf_usb_demo/dsp/srtm_LineInOut.c
//    read_length = DSP_AudioReadRing(dsp, usbSpeaker_inbuf[0], PCM_GAIN_FRAME_SIZE);
//
//    if (read_length > 0)
//        ret = xaf_comp_process(dsp->audio_device, dsp->comp, usbSpeaker_inbuf[0], read_length, XAF_INPUT_READY_FLAG);
//    else
//    {
//        DSP_PRINTF("[DSP_LINE_INOUT] Initial data not available\r\n");
//        goto error_cleanup;
//    }
//    if (ret != XAF_NO_ERR)
//    {
//        DSP_PRINTF("[DSP_LINE_INOUT] xaf_comp_process XAF_INPUT_READY_FLAG failure: %d\r\n", ret);
//        goto error_cleanup;
//    }

#if 0
    /* Delete previous cleanup thread if valid */
    if (xos_thread_get_state(&dsp->cleanup_thread) != XOS_THREAD_STATE_INVALID)
    {
        xos_thread_delete(&dsp->cleanup_thread);
        memset((void *)&dsp->cleanup_thread, 0, sizeof(XosThread));
    }

    /* Initialize playback state */
    dsp->line_inout = true;
    xos_event_clear(&dsp->pipeline_event, XOS_EVENT_BITS_ALL);

    /* Initialize buffer read/write functions */
    dsp->audio_read  = DSP_AudioReadRing;
    dsp->audio_write = DSP_AudioWriteRing;

    /* Threads */
    /* Start processing thread */
    xos_thread_create(&dsp->process_thread, NULL, DSP_ProcessThread, (void *)dsp, "DSP_ProcessThread",
    		LineInOut_process_stack, STACK_SIZE, 7, 0, 0);

    /* Start cleanup/exit thread */
    xos_thread_create(&dsp->cleanup_thread, NULL, srtm_lineInOut_cleanup, (void *)dsp, "srtm_lineInOut_cleanup",
    		LineInOut_cleanup_stack, STACK_SIZE, 7, 0, 0);
#else
    DSP_PRINTF("[TYM][DSP] Start capturer->pcm/gain->renderer\r\n");
    while (1)
    {
        /* Sleep 100 msec */
        xos_thread_sleep_msec(100);

        /* Check renderer for errors */
        cid            = XA_RENDERER_0;
        param[0]       = XA_RENDERER_CONFIG_PARAM_STATE;
        param[2]       = XA_RENDERER_CONFIG_PARAM_BYTES_PRODUCED;
        ret            = xaf_comp_get_config(comp_get_pointer(dsp, cid, false), 2, &param[0]);
        renderer_state = param[1];

        if (ret != XAF_NO_ERR)
        {
            DSP_PRINTF("renderer get_config error:%x\n", ret);
            return -1;
        }
    }
#endif

    return 0;

error_cleanup:
    return LineInOut_close(dsp, false);
}
#else
int srtm_line_inout_init(dsp_handle_t *dsp, unsigned int *pCmdParams, bool i2s)
{
    void *p_adev = NULL;
    void *p_comp[NUM_COMP_IN_GRAPH];
    xf_id_t comp_id[NUM_COMP_IN_GRAPH];
    int i, k, cid;
    int (*comp_setup[NUM_COMP_IN_GRAPH])(void *p_comp, xaf_format_t *, bool);
    xaf_comp_type comp_type[NUM_COMP_IN_GRAPH];
    xaf_format_t comp_format[NUM_COMP_IN_GRAPH];
    xaf_comp_status comp_status;
    int comp_ninbuf[NUM_COMP_IN_GRAPH];
    int comp_noutbuf[NUM_COMP_IN_GRAPH];
    int param[4], renderer_state;
    int channels, sampling_rate, width;
    int info[4];
    XAF_ERR_CODE ret;
    xaf_adev_config_t device_config;
    xaf_comp_config_t comp_config[NUM_COMP_IN_GRAPH];

    channels      = pCmdParams[0];
    sampling_rate = pCmdParams[1];
    width         = pCmdParams[2];

    for (i = 0; i < NUM_COMP_IN_GRAPH; i++)
    {
        cid         = comp_get_order_lineinout[i];
        p_comp[cid] = NULL;
        memset(&comp_format[cid], 0, sizeof(xaf_format_t));
        comp_setup[cid]   = NULL;
        comp_type[cid]    = -1;
        comp_id[cid]      = NULL;
        comp_ninbuf[cid]  = 0;
        comp_noutbuf[cid] = 0;

        switch (cid)
        {
            case XA_CAPTURER_0:
                comp_format[cid].sample_rate = sampling_rate;
                comp_format[cid].channels    = channels;
                comp_format[cid].pcm_width   = width;
                comp_setup[cid]              = capturer_setup;
                comp_type[cid]               = XAF_CAPTURER;
                if (i2s)
                {
                    comp_id[cid] = "capturer_i2s";
                }
                else
                {
                    comp_id[cid] = "capturer_dmic";
                }
                break;

            case XA_GAIN_0:
                comp_format[cid].sample_rate = sampling_rate;
                comp_format[cid].channels    = channels;
                comp_format[cid].pcm_width   = width;
                comp_setup[cid]              = pcm_gain_setup;
                comp_type[cid]               = XAF_POST_PROC;
                comp_id[cid]                 = "post-proc/pcm_gain";
                break;
            case XA_RENDERER_0:
                comp_format[cid].sample_rate = sampling_rate;
                comp_format[cid].channels    = channels;
                comp_format[cid].pcm_width   = width;
                comp_setup[cid]              = renderer_setup;
                comp_type[cid]               = XAF_RENDERER;
                comp_id[cid]                 = "renderer";
                break;

            default:
                DSP_PRINTF("Check component type in comp_get_order_lineinout table\n\r");
                return -1;
        }
    }

    xaf_adev_config_default_init(&device_config);

    device_config.pmem_malloc                 = DSP_Malloc;
    device_config.pmem_free                   = DSP_Free;
    device_config.audio_component_buffer_size = AUDIO_COMP_BUF_SIZE;
    device_config.audio_framework_buffer_size = AUDIO_FRMWK_BUF_SIZE;

    ret = xaf_adev_open(&p_adev, &device_config);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_adev_open failure: %d\r\n", ret);
        return -1;
    }

    DSP_PRINTF("\nAudio Device Ready\n\r");

    /* Create and setup all components */
    for (k = 0; k < NUM_COMP_IN_GRAPH; k++)
    {
        cid = comp_get_order_lineinout[k];
		DSP_PRINTF("[TYM][DSP_LINE_INOUT] k: %d, cid: %d\r\n",k,cid);
        xaf_comp_config_default_init(&comp_config[cid]);

        comp_config[cid].comp_id            = comp_id[cid];
        comp_config[cid].num_input_buffers  = comp_ninbuf[cid];
        comp_config[cid].num_output_buffers = comp_noutbuf[cid];
        comp_config[cid].comp_type          = comp_type[cid];
        DSP_PRINTF("[TYM] cid: %d\n\r",k);
        ret = xaf_comp_create(p_adev, &p_comp[cid], &comp_config[cid]);
        if (ret != XAF_NO_ERR)
        {
            DSP_PRINTF("xaf_comp_create[%d] failure: %d\r\n", k, ret);
            return -1;
        }
        DSP_PRINTF("[TYM] comp_setup --\n\r");
        ret = comp_setup[cid](p_comp[cid], &comp_format[cid], i2s);
        if (ret != XAF_NO_ERR)
        {
            DSP_PRINTF("comp_setup failure: %d\r\n", ret);
            return -1;
        }
    }

