gillwei7/NXP_RT600/boards/mimxrt685audevk/dsp_examples/xaf_usb_demo/dsp/srtm_LineInOut.c
    /* Start capturer */
    ret = xaf_comp_process(p_adev, p_comp[XA_CAPTURER_0], NULL, 0, XAF_START_FLAG);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_comp_process XAF_START_FLAG CAPTURER_0 failure: %d\r\n", ret);
        return -1;
    }

    ret = xaf_comp_get_status(p_adev, p_comp[XA_CAPTURER_0], &comp_status, &info[0]);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_comp_get_status CAPTURER_0 failure: %d\r\n", ret);
        return -1;
    }

    /* Start renderer component */
    ret = xaf_comp_process(p_adev, p_comp[XA_RENDERER_0], NULL, 0, XAF_START_FLAG);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_comp_process XAF_START_FLAG RENDERER_0 failure: %d\r\n", ret);
        return -1;
    }

    ret = xaf_comp_get_status(p_adev, p_comp[XA_RENDERER_0], &comp_status, &info[0]);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_comp_get_status RENDERER_0 failure: %d\r\n", ret);
        return -1;
    }

    /* Connect all the non-input components and then only START each of the dest components */
    ret = xaf_connect(p_comp[XA_CAPTURER_0], 0, p_comp[XA_GAIN_0], 0, 4);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_connect CAPTURER_0 -> GAIN_0 failure: %d\r\n", ret);
        return -1;
    }
    ret = capturer_start_operation(p_comp[XA_CAPTURER_0]);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("Capturer start operation failure.\r\n");
        return -1;
    }

    DSP_PRINTF("connected CAPTURER -> GAIN_0\n\r");

    /* Start PCM gain */
    ret = xaf_comp_process(p_adev, p_comp[XA_GAIN_0], NULL, 0, XAF_START_FLAG);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_comp_process XAF_START_FLAG GAIN_0 failure: %d\r\n", ret);
        return -1;
    }

    ret = xaf_comp_get_status(p_adev, p_comp[XA_GAIN_0], &comp_status, &info[0]);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_comp_get_status GAIN_0 failure: %d\r\n", ret);
        return -1;
    }

    /* Start renderer DMA output.  Will output I2S zeros until valid data is
     * available. */
    renderer_start_operation(p_comp[XA_RENDERER_0]);

    ret = xaf_connect(p_comp[XA_GAIN_0], 1, p_comp[XA_RENDERER_0], 0, 4);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_connect GAIN_0 -> RENDERER_0 failure: %d\r\n", ret);
        return -1;
    }

    DSP_PRINTF("connected XA_GAIN_0 -> XA_RENDERER_0\n\r");


    // TYM DSP add >>
//    get_render_config(p_comp[XA_RENDERER_0], &comp_format[XA_RENDERER_0]);
    // TYM DSP add <<

    while (1)
    {
        /* Sleep 100 msec */
        xos_thread_sleep_msec(100);

        /* Check renderer for errors */
        cid            = XA_RENDERER_0;
        param[0]       = XA_RENDERER_CONFIG_PARAM_STATE;
        param[2]       = XA_RENDERER_CONFIG_PARAM_BYTES_PRODUCED;
        ret            = xaf_comp_get_config(p_comp[cid], 2, &param[0]);
        renderer_state = param[1];

        if (ret != XAF_NO_ERR)
        {
            DSP_PRINTF("renderer get_config error:%x\n", ret);
            return -1;
        }
    }
    DSP_PRINTF("[TYM] out of while\n\r");

    for (k = 0; k < NUM_COMP_IN_GRAPH; k++)
    {
        cid = comp_get_order_lineinout[k];
        ret = xaf_comp_delete(p_comp[cid]);
        if (ret != XAF_NO_ERR)
        {
            DSP_PRINTF("xaf_comp_delete[%d] failure: %d\r\n", k, ret);
            return -1;
        }
    }

    xaf_adev_close(p_adev, XAF_ADEV_NORMAL_CLOSE);
    if (ret != XAF_NO_ERR)
    {
        DSP_PRINTF("xaf_adev_close failure: %d\r\n", ret);
        return -1;
    }

    DSP_PRINTF("Audio device closed\n\n\r\r");

    return 0;
}
#endif

int srtm_lineInOut_cleanup(void *arg, int wake_value)
{
    int32_t exitcode;
    dsp_handle_t *dsp = (dsp_handle_t *)arg;

    DSP_PRINTF("[DSP_CleanupThread] start\r\n");

    /* Wait for processing thread to complete before exiting. */
    xos_thread_join(&dsp->process_thread, &exitcode);
    xos_thread_delete(&dsp->process_thread);

    return LineInOut_close(dsp, true);
}
